In [13]:
import pandas
import pandas as pd
df=pd.read_excel(r"C:\Users\hp\Desktop\anna_canteen (1).xlsx")
df

,No.of Anna Canteens,(All),Unnamed: 2,Unnamed: 3
0,NaN,NaN,NaN,NaN
1,Sum of No.of Plates Consumed,Sum of Total Available food plates,Sum of No.of Customer,Sum of rating
2,29090,31910,30000,374

In [ ]:
import pandas
import pandas as pd
colour_names=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\colour_names.xlsx",sheet_name="swathi")
colour_names